In [1]:
%matplotlib inline
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import pandas as pd
plt.style.use('ggplot')

In [2]:
df = pd.read_csv('./../data/tested.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [3]:
df.Survived

0      0
1      1
2      0
3      0
4      1
      ..
413    0
414    1
415    0
416    0
417    0
Name: Survived, Length: 418, dtype: int64

In [4]:
colonnes = ['Survived', 'Pclass', 'Sex', 'Age']
df = df[colonnes]

In [5]:
df.dropna(inplace=True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 332 entries, 0 to 415
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  332 non-null    int64
 1   Pclass    332 non-null    int64
 2   Sex       332 non-null    object
 3   Age       332 non-null    float64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.0+ KB

In [7]:
df.Sex = df['Sex'].replace(['female','male'], [0, 1])

In [8]:
from sklearn.preprocessing import StandardScaler, MinMaxScaler
data = pd.DataFrame()

In [9]:
stCaler = MinMaxScaler()
data = df[['Pclass', 'Sex', 'Age']]

In [10]:
# data = stCaler.fit_transform(data)

In [11]:
data = pd.DataFrame(data)
data.columns = ['Pclass', 'Sex', 'Age']
data['Survived'] = [int(i) for i in df.Survived]

In [12]:
data.head()

   Pclass  Sex   Age  Survived
0       3    1  34.5         0
1       3    0  47.0         1
2       2    1  62.0         0
3       3    1  27.0         0
4       3    0  22.0         1

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 332 entries, 0 to 415
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Pclass    332 non-null    int64
 1   Sex       332 non-null    int64
 2   Age       332 non-null    float64
 3   Survived  332 non-null    int64
dtypes: float64(1), int64(3)
memory usage: 13.0 KB

In [14]:
# df.Survived = pd.to_numeric(df.Survived)
# df['Survived'] = df['Survived'].replace(-0, 0)

In [15]:
data.head()

   Pclass  Sex   Age  Survived
0       3    1  34.5         0
1       3    0  47.0         1
2       2    1  62.0         0
3       3    1  27.0         0
4       3    0  22.0         1

In [16]:
data.to_csv('./../data/titanic.csv', index=False, index_label=True)

In [17]:
len(df)

332